{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 128,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "B-CAPACITY",
    "2": "I-CAPACITY",
    "3": "B-CATEGORY",
    "4": "I-CATEGORY",
    "5": "B-CLASS_MODE",
    "6": "I-CLASS_MODE",
    "7": "B-COURSE_NAME",
    "8": "I-COURSE_NAME",
    "9": "B-COURSE_YEAR",
    "10": "I-COURSE_YEAR",
    "11": "B-CREDIT",
    "12": "I-CREDIT",
    "13": "B-DAY",
    "14": "I-DAY",
    "15": "B-DEPARTMENT",
    "16": "I-DEPARTMENT",
    "17": "B-ENROLLED",
    "18": "I-ENROLLED",
    "19": "B-EVAL_TYPE",
    "20": "I-EVAL_TYPE",
    "21": "B-GRADE_METHOD",
    "22": "I-GRADE_METHOD",
    "23": "B-PROFESSOR",
    "24": "I-PROFESSOR",
    "25": "B-ROOM",
    "26": "I-ROOM",
    "27": "B-SECTION",
    "28": "I-SECTION",
    "29": "B-TIME",
    "30": "I-TIME",
    "31": "B-VACANCY",
    "32": "I-VACANCY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "is_decoder": false,
  "label2id": {
    "B-CAPACITY": 1,
    "B-CATEGORY": 3,
    "B-CLASS_MODE": 5,
    "B-COURSE_NAME": 7,
    "B-COURSE_YEAR": 9,
    "B-CREDIT": 11,
    "B-DAY": 13,
    "B-DEPARTMENT": 15,
    "B-ENROLLED": 17,
    "B-EVAL_TYPE": 19,
    "B-GRADE_METHOD": 21,
    "B-PROFESSOR": 23,
    "B-ROOM": 25,
    "B-SECTION": 27,
    "B-TIME": 29,
    "B-VACANCY": 31,
    "I-CAPACITY": 2,
    "I-CATEGORY": 4,
    "I-CLASS_MODE": 6,
    "I-COURSE_NAME": 8,
    "I-COURSE_YEAR": 10,
    "I-CREDIT": 12,
    "I-DAY": 14,
    "I-DEPARTMENT": 16,
    "I-ENROLLED": 18,
    "I-EVAL_TYPE": 20,
    "I-GRADE_METHOD": 22,
    "I-PROFESSOR": 24,
    "I-ROOM": 26,
    "I-SECTION": 28,
    "I-TIME": 30,
    "I-VACANCY": 32,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 35000
}
